TEMP/Documents/COV_ЗаболеваниеCOVID.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>COV_ЗаболеваниеCOVID</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.COV_ЗаболеванияКороновируснойИнфекцией</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.COV_СертификатОВакцинацииОтCOVID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействияСертификата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецДействияСертификата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОсвобожденияОтПрививки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

TEMP/Documents/COV_СертификатОВакцинацииОтCOVID.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>COV_СертификатОВакцинацииОтCOVID</Name>
			<BasedOn>
				<xr:Item>Document.COV_ПрохождениеВакцинацииОтCOVID</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.COV_СертификатыОВакцинацииОтCOVID</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.COV_ПрохождениеВакцинацииОтCOVID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВакцины</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.COV_ТипыВакцины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействияСертификата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецДействияСертификата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДействияССертификатом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

TEMP/Documents/COV_ЗаболеваниеCOVID/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура СертификатПриИзмененииНаСервере()
	Объект.НачалоДействияСертификата = Объект.Сертификат.НачалоДействияСертификата;
	Объект.КонецДействияСертификата = Объект.Сертификат.КонецДействияСертификата;
КонецПроцедуры

&НаКлиенте
Процедура СертификатПриИзменении(Элемент)
	СертификатПриИзмененииНаСервере();
КонецПроцедуры


&НаСервереБезКонтекста
Функция СертификатНачалоВыбораНаСервере(Сотрудник)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.Текст = "ВЫБРАТЬ
	|	COV_СертификатОВакцинацииОтCOVID.Ссылка КАК Сертификат
	|ИЗ
	|	Документ.COV_СертификатОВакцинацииОтCOVID КАК COV_СертификатОВакцинацииОтCOVID
	|ГДЕ
	|	COV_СертификатОВакцинацииОтCOVID.Сотрудник = &Сотрудник
	|	И НЕ COV_СертификатОВакцинацииОтCOVID.ПометкаУдаления";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сертификат");
КонецФункции

&НаКлиенте
Процедура СертификатНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Элемент.СписокВыбора.Очистить();
	мсСертификатыСотрудника = СертификатНачалоВыбораНаСервере(Объект.Сотрудник);
	Элемент.СписокВыбора.ЗагрузитьЗначения(мсСертификатыСотрудника);
КонецПроцедуры
